<template>
    <div class="layout"
        :class="{'layout--cantscroll':!canScroll}">
        <button class="layout__button"
            @click="open(true)">
            打开弹窗
        </button>
        <p class="layout__p"
            v-for="(item,index) in contentList"
            :key="index">{{item}}</p>
        <button class="layout__button"
            @click="open(false)">
            打开弹窗
        </button>
        <div class="layout__mask"
            v-show="isShowMask"
            @click="close">
            <p>弹窗</p>
        </div>
    </div>
</template>

<script>
export default {
    data: () => ({
        canScroll: true,
        isShowMask: false,
        contentList: [
            '这个问题也是之前困扰了我很久的问题。不过我现在想通了，对于【高数、离散、线性代数、概率论】等课程，很好解释，做算法的同学肯定知道为啥要学习这些课程。机器学习中会大量用到上述提到的课程，所以会比较好理解。对在校生而言，学校开设的很多课程我们不知道为什么要学，我们很疑惑，不知道学它有什么用，这个时候我们就会很纠结，还会产生抵触情绪。这很正常，因为我们学习得不够深入，自然不能理解它们的用处。',
            '在我看来，大学本科课程更多的是面向“面”的教学，即什么课程都教给你一些，但是又讲得不那么深入；而工作或者读研，更多的则是面向“点”的学习，用到的知识更专。本科时，学校也不知道你以后是去搞算法、还是搞架构、还是搞服务器开发，甚至去搞硬件，所以学校需要你学很多课程，至少有个了解。对学生来说，一方面可以从中选择自己感兴趣的点；一方面也可以对未来的就业方向有些启发。所以即使像数电、模电等课程，虽然之后可能用不着，但是你也要学，并且会花费大量的时间。虽然你最后不一定去搞硬件，但是这些课程也会让你更容易去理解一些知识，比如cpu中的逻辑器件。',
            '如果你在大一的时候就有一个明确的定位，知道自己今后想从事哪方面的工作，课程与课程之间是可以调一下优先级的。不过像大学物理，这种课程确实是对编程没有帮助，但是像我前面所说的，大学教育更注重广度，大物等课程可能就是为了给你普及生活常识吧。',
            '其实，大学教育的问题是普遍存在的，我认为我们学习一项技能的时候，应该采取的是项目驱动式学习，即需要用到什么东西时不会了再去学，而不是先填鸭式的都填进脑子，并且在学习的过程中我们还不知道它这是干嘛用的，等之后用到了，甚至不记得自己学过，反而查资料才会想起：哦，原来我之前学的xx科目是这个用处啊，可是我当时并没有好好学。很多时候学生时间的浪费可能还是要怪老师、怪学校，他们一开始没给我们做好充分的课程介绍。所以，在经过比较多的编程和项目实践后，我认为一个比较好的学习方式是，改良版的项目驱动学习法。即：',
            '学习一段时间，做个小项目，将做项目遇到的问题记下来，针对性地学习相关知识，然后再实践，再学一段时间理论，让知识成网状发射状地变大。当然，项目驱动式学习有一个弊端，就是每次学习的知识都是项目所需要的，很零碎、不成体系，所以需要改良，即在采取项目驱动学习法的时候每天抽一段时间去完整地读一本书，或者一个相关问题的完整介绍，这样就很容易把一些知识成体系地串起来。这样一段时间下来，慢慢的，你就知道我们为什么要学那么多科目，学这些科目能干什么。',
            '我认为不只是编程需要制定计划，其他任何的学习和工作都需要制定计划。我从13年上大学就开始定期给自己制定计划，这个习惯也一直坚持到了现在，受益匪浅。当然也不只是制定学习计划，还可以列一些自己需要做的其他的事情。我最近在整理笔记的时候也发现了一些之前记录的计划和清单，可以给大家看看。比如下图就是我14年写的笔记，笔记上都留下了最后一次打开的时间。列举了一些自己需要看的文章，因为当时不太懂得规划，所以比较乱',
            '到了16年的时候，我做计划做得更加有条理了。下图是16年10月30日的计划，那时候我已经大四了，并且已经找到了工作、签了满意的offer，并且没有什么课，按理说可以放松放松了，不过我还是制定了一些学习计划，并且选择在11月去百度实习。从内容上看，主要是学习英语和计算机专业课，因为大一大二的时候我确实不明白为什么要学习专业课，到了大三下想清楚原因以后，我也就一直在重新学习，因为计算机专业课真的很重要！学好了这些课，能让你在日后的学习工作中轻松不少',
            '除了大四制定的计划外，大二的时候我也制定过较为详细的学习计划（如下图），把需要学习的内容进行了编号，存入表格，这样才能让你过得有条不紊。当然，很难完全按照计划去执行，不过制定相应的计划能让你清楚地知道自己应该干什么。',
            '所以，如果你是在校生，那么好好制定一个计划吧，因为你有大把的时间。当然，如果你已经毕业了，没关系，我现在也在上班，同样也列举了自己最近要学习的内容，如下图（2月27日更新过），包括了短期和长期需要学习的内容：'
        ]
    }),
    methods: {
        open: function (status) {
            this.isShowMask = !this.isShowMask;
            this.canScroll = status;
        },
        close: function () {
            this.isShowMask = !this.isShowMask;
            this.canScroll = true;
        }
    }
}
</script>

<style lang='scss' scoped>
.layout {
  padding: 16px 32px;
  &.layout--cantscroll {
    position: fixed;
    top: 0;
    left: 0;
  }
}
.layout__p {
  line-height: 40px;
  font-size: 28px;
  text-indent: 56px;
}
.layout__button {
  display: block;
  padding: 15px 45px;
  margin: 30px auto;
  font-size: 30px;
  border-radius: 8px;
  border: 1px solid #000;
  outline: none;
  background-color: #fff;
}
.layout__mask {
  position: fixed;
  display: flex;
  justify-content: center;
  align-items: center;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, 0.5);
  p {
    padding: 30px 80px;
    font-size: 32px;
    background-color: #fff;
    border-radius: 8px;
  }
}
</style>
